package belhard;
import java.util.Scanner;
public class Homework07 {
	/*Даны два целых числа: D (день) и M (месяц), определяющие правильную дату. 
	Вывести знак Зодиака, соответствующий этой дате: «Водолей» (20.1–18.2), «Рыбы» (19.2–20.3), «Овен» (21.3–19.4),
	«Телец» (20.4–20.5), «Близнецы» (21.5–21.6), (22.6-22.7), «Лев» (23.7–22.8), «Дева» (23.8–22.9), «Весы» (23.9–22.10), 
	«Скорпион» (23.10–22.11), «Стрелец» (23.11–21.12), «Козерог» (22.12–19.1).*/

	public static void main(String[] args) {
		Scanner s = new Scanner (System.in);
		System.out.println("Введите день месяца от 1 до 31: ");
		int d= s.nextInt();
		System.out.println("Введите месяц от 1 до 12: ");
		int m = s.nextInt();
		if (d>=20&&m==1 || d<=18&&m==2) {
			System.out.println("Вы ввели дату: "+d+"."+m+"\nэто это Водолей");
			}
		else if (d>=19&&m==2||d<=20&&m==3) {
			System.out.println("Вы ввели дату: "+d+"."+m+"\nэто это Рыбы");
			
		}
		else if (d>=21&&m==3||d<=19&&m==4) {
			System.out.println("Вы ввели дату: "+d+"."+m+"\nэто это Овен");
			
		}
		else if (d>=20&&m==4||d<=20&&m==5) {
			System.out.println("Вы ввели дату: "+d+"."+m+"\nэто Телец");
			
		}
		else if (d>=21&&m==5||d<=21&&m==6) {
			System.out.println("Вы ввели дату: "+d+"."+m+"\nэто Близнецы");
			
		}
		else if (d>=23&&m==7||d<=22&&m==8) {
			System.out.println("Вы ввели дату: "+d+"."+m+"\nэто Лев");
			
		}
		else if (d>=23&&m==8||d<=22&&m==9) {
			System.out.println("Вы ввели дату: "+d+"."+m+"\nэто это Дева");
			
		}
		else if (d>=23&&m==9||d<=22&&m==10) {
			System.out.println("Вы ввели дату: "+d+"."+m+"\nэто это Весы");
			
		}
		else if (d>=23&&m==10||d<=22&&m==11) {
			System.out.println("Вы ввели дату: "+d+"."+m+"\nэто Скорпион");
			
		}
		else if (d>=23&&m==11||d<=21&&m==12) {
			System.out.println("Вы ввели дату: "+d+"."+m+"\nэто это Стрелец");
			
		}
		else if (d>=22&&m==12||d<=19&&m==1) {
			System.out.println("Вы ввели следующую дату: "+d+"."+m+" это Козерог");
			
		}
			
			
		}
		
		
		}

